eval> (define a 1)
ok

eval> (define b 2)
ok

eval> (add-tag a 'apple)
(apple)

eval> (add-tag b 'banana)
(banana)

eval> (define c (+ a b))
ok

eval> (get-tags c)
((apple) (banana))

eval> (define (foo) a)
ok

eval> (define d (foo))
ok

eval> (get-tags d)
(apple)

eval> 
